// let str = "zzzzyzz";
// str.includes('y') ? console.log('нашел') : console.log('заблудился');

// ⏺️
// 6 задание
// Создай программу для
// let str = "zzzzyzz";
// используя тернарный оператор и метод includes.Если нашел букву "y", то отконсоль "нашел", если не нашел, то "заблудился"

// ⏺️ Деплой и отправка на проверку​​
// После выполнения задания задеплойте приложение на github pages
// Убедитесь, что ваше приложение открывается по ссылке со всеми внесенными изменениями
// Вставьте в input ссылку, по которой отображается ваш фронт
// Нажмите на кнопку "отправить на проверку" - через некоторое время "обновите статус"
// Если дз не прошла проверку, то читайте какие ошибки вы доспустили и пробуйте исправить ошибку
// Исправьте и сделайте деплой еще раз.Проверьте что изменения появились по ссылке - и отправьте на проверку повторно

// ❗ Обратите внимание
// Не удаляйте и не комментируйте выполненные задания.Т.е.если вы делаете 3 задание, у вас в репозитории должно быть выполнено 1 и 2 задание.Если делаете 4 - е, то должно быть выполнение 1, и 2 и 3 и т.д.
// В файле задания должен быть только рабочий вариант кода.Если будет какой - то закомментированный код, задание на пройдет автотест
// Если в задании используется переменная с определенным именем(например number1 или passport), то менять имя переменной запрещено